// pages/index.js
import NavBar from '@/components/NavBar'
import Link from 'next/link'
import { Container } from 'react-bootstrap'


export default function Home() {
	return (
		<div>
			<NavBar />
			<Container className="mt-5">
				<section className='hero'>
					<h1>Вітаємо у Реєстрі</h1>
					<p>
						Наш веб-клієнт дозволяє легко створювати та шукати записи в електронному реєстрі.
						Ви можете виконувати такі дії:
					</p>
					<ul>
						<li>Додати нову особу до реєстру, надавши детальну особисту інформацію.</li>
						<li>Шукати існуючі записи, використовуючи часткові або повні дані.</li>
						<li>Переглядати детальну інформацію про конкретну особу за допомогою її унікального ідентифікатора.</li>
          <li>Через профіль особи редагувати або відаляти існуючі записи.</li>
					</ul>
					<p>
						Щоб почати, ви можете відвідати сторінку <Link href="/add-person">Додати особу</Link> для створення нового запису або сторінку <Link href="/find-person">Знайти особу</Link> для пошуку існуючих записів.
					</p>
					<p>Ми сподіваємось, що ви знайдете наш сервіс корисним та зручним у використанні.</p>
				</section>
			</Container>
		</div>
	)
}
